Table of Contents
 Class OpenAttribute
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Open attribute base class
public abstract class OpenAttribute : OpenObject
Inheritance
object
OpenObject
OpenAttribute
Derived
ConcreteMemberData
CrossSectionCreepCoefficientAttribute
CrossSectionThermalAttribute
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Element
Element for attribute
public ReferenceElement Element { get; set; }
Property Value
ReferenceElement
 Edit this page